run/icoPhaseChangeVoF/testGreyBodyRadiation/0/T.water
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volScalarField;
    location    "0";
    object      T.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 800;

boundaryField
{
    top
    {
        type            calculated;
        value           uniform 800;
    }
    left
    {
        type            calculated;
        value           uniform 800;
    }
    right
    {
        type            calculated;
        value           uniform 800;
    }
    bottom
    {
        type            calculated;
        value           uniform 800;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
