run/icoPhaseChangeVoF/testGreyBodyRadiation/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          ( water air );


sigma
{
  type  temperatureDependent;
  sigma
  {
    type    table;
    values
    (
        (200 0.02)
        (400 0.0)
    );
    outOfBounds         clamp;
    interpolationScheme linear;
  }
}

// ************************************************************************* //