run/icoPhaseChangeVoF/testGreyBodyRadiation/system/cellMax
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out the maximum cell value for one or more fields.

\*---------------------------------------------------------------------------*/

type            volFieldValue;

libs            ("libfieldFunctionObjects.so");

log             true;

writeControl    timeStep;

writeFields     false;

regionType      all;

cellZone        all;

operation       max;

fields (T);

// ************************************************************************* //