run/icoPhaseChangeVoF/testGreyBodyRadiation/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          icoPhaseChangeVoF;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5e-8;

deltaT          5e-8;

writeControl    adjustableRunTime;

writeInterval   5e-8;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDiCo         1000.0;

maxDeltaT       5e-5;


// ************************************************************************* //

DebugSwitches
{
    greyBodyRadiation 1;
}

OptimisationSwitches
{
    fileHandler collated;
}

functions
{
    #includeFunc cellMax;
    #includeFunc cellMin;
    #includeFunc radiation;
}