run/icoPhaseChangeVoF/testGreyBodyRadiation/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.water 0;
    //T ${${FOAM_CASE}/constant/fvModels!radiation/T0};
    T ${${FOAM_CASE}/0/T.orig!T0};
}

zones
{
    plate
    {
    	type box;

        box (-1 -1 -1) (1 0.0002 1);

        values
    	{
    	    alpha.water 1;
            T ${${FOAM_CASE}/0/T.orig!T0};
        }
    }
}

// ************************************************************************* //